&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	//Получить текущую строку табличной части
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;

	//Проверка вида номенклатуры
	Проверка = ПроверкаВидаНоменклатуры(СтрокаТабличнойЧасти.Материал);
	Если Проверка Тогда
		//Установить цену
		СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Материал);
		//пересчитать сумму строки
		РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	Иначе
		Сообщить("В документе ПриходнаяНакладная можно выбирать только материалы. Выберите материал!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаВидаНоменклатуры(Материал)
	Если Материал.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал Тогда
		Рез = Истина;
	Иначе
		Рез = Ложь;
	КонецЕсли;
	Возврат Рез;
КонецФункции
